{
  "backend/main.mo": "Main Motoko actor implementing photo upload/delete/list, user profile management, and a credit system with free/pro tiers, using role-based access control via MixinAuthorization and blob storage via MixinStorage.",
  "feature_evidence.json": "Feature evidence report mapping two cinematic video preview features (REQ-27, REQ-28) to their target files: VideoResultScreen.tsx for the animated preview UI and index.css/tailwind.config.js for the supporting keyframe animations.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose, covering components like VideoResultScreen, App, and hooks, plus CSS/Tailwind config with cinematic animation keyframes.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based design tokens for light and dark themes, applied via CSS custom properties on :root and .dark.",
  "frontend/index.html": "Minimal HTML shell that mounts the React app into a #root div and loads the main TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Root React component providing a sticky header with logo, tab navigation (Text to Video / Image to Video), authentication via Internet Identity, credit display, and routing between TextToVideoScreen, ImageToVideoScreen, and VideoResultScreen.",
  "frontend/src/components/AnimationPreviewScreen.tsx": "Preview screen that applies a selected CSS keyframe animation to an uploaded photo, allows template switching, and saves the photo to the backend as an ArrayBuffer via the useUploadPhoto mutation.",
  "frontend/src/components/CreditDisplay.tsx": "Displays the user's credit balance or PRO badge in the UI, and shows an 'Upgrade' button when credits are exhausted.",
  "frontend/src/components/DurationSelector.tsx": "Renders a row of buttons for selecting video duration (5s, 10s, 15s) with highlighted selection state.",
  "frontend/src/components/ImageToVideoScreen.tsx": "Provides an image upload interface (drag-and-drop or file picker) with style, duration, quality, and music settings, then triggers video generation while consuming a credit.",
  "frontend/src/components/MusicSelector.tsx": "Toggle switch to enable background music for video generation, with track selection buttons (Upbeat, Chill, Epic) shown when enabled.",
  "frontend/src/components/QualitySelector.tsx": "Renders 720p and 1080p quality option buttons, locking 1080p behind a Pro upgrade prompt for non-Pro users.",
  "frontend/src/components/StepIndicator.tsx": "Displays a three-step progress indicator (Upload, Template, Preview) with active, completed, and inactive visual states.",
  "frontend/src/components/StyleSelector.tsx": "Grid of four visual style buttons (Cinematic, Anime, Cartoon, 3D Effect) with image previews and a glow highlight on the selected style.",
  "frontend/src/components/TemplateSelectionScreen.tsx": "Shows the uploaded photo alongside a grid of animation template cards for selection, with back/next navigation buttons.",
  "frontend/src/components/TextToVideoScreen.tsx": "Text prompt input screen for video generation with an AI enhance button, plus style, duration, quality, and music settings, consuming a credit on generate.",
  "frontend/src/components/UpgradeModal.tsx": "A modal dialog that presents Pro plan benefits and pricing, allowing users to upgrade via a mutation call with success/error toast feedback.",
  "frontend/src/components/UploadScreen.tsx": "A drag-and-drop image upload component that validates file type (JPEG/PNG/GIF/WebP) and size (max 5MB), then passes the file and a base64 preview to a callback.",
  "frontend/src/components/VideoResultScreen.tsx": "Displays a generated video result with a cinematic preview overlay, film grain effects, and download/share/back actions.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an authenticated or anonymous ICP backend actor, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context with login/logout functionality, delegation validation, and status tracking via React context and AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for photo CRUD operations, credit status retrieval, credit consumption, and Pro upgrade mutations against the ICP backend actor.",
  "frontend/src/index.css": "Global stylesheet defining dark-mode CSS custom properties, Tailwind base/utilities, custom gradient/glow utility classes, and keyframe animations like shimmer and videoScan.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider for data fetching and InternetIdentityProvider for authentication.",
  "frontend/src/types/templates.ts": "Defines TypeScript types and a constant array of 7 animation templates (walk, dance, fly, spin, bounce, zoom, shake) with metadata like name, emoji, CSS class, colors, and duration.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routing, with sessionStorage persistence helpers for maintaining values across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts, colors (using CSS variables), border radii, box shadows, gradients, and keyframe animations like shimmer, pulse-glow, fadeInUp, and filmGrain.",
  "project_state.json": "Project state tracking file describing an AI-powered text/image-to-video generation app (Pixverse-inspired), listing existing features, architectural notes, known issues, and versioning metadata."
}